import React from 'react';
import './App.css';
import './index.css';
import './card.css';
import { useLocation } from 'react-router-dom';

function getRandomValue(arr) {
    const randomIndex = Math.floor(Math.random() * arr.length);  // สุ่มดัชนีของ array
    return arr[randomIndex];  // คืนค่าตัวแปรจากดัชนีที่สุ่มได้
  }
  
// ตัวอย่างการใช้งาน
const colors = ["ขอบคุณเพื่อน ๆ ทุกคนที่มาร่วมแสดงความยินดีในวันปัจฉิมของเรา การได้เห็นเพื่อนที่เคยร่วมทุกข์ร่วมสุขกันมาตลอดหลายปี มาร่วมแบ่งปันความรู้สึกดี ๆ ในวันนี้ทำให้เรารู้สึกอบอุ่นใจอย่างมาก ทุกคำอวยพรและความปรารถนาดีที่เพื่อนมอบให้ ไม่ว่าจะเป็นคำพูดหรือการกระทำ ล้วนเป็นกำลังใจสำคัญที่ช่วยให้เรามีพลังในการเดินต่อไปสู่อนาคตข้างหน้า",
     "ตลอดเวลาที่ผ่านมา เราได้ผ่านเรื่องราวต่าง ๆ มาด้วยกัน ทั้งความสุข ความเศร้า ความสำเร็จ และความผิดหวัง ทุกประสบการณ์ที่เราแบ่งปันกันได้หล่อหลอมให้เรากลายเป็นคนที่เข้มแข็งขึ้น การได้มีเพื่อนที่คอยอยู่เคียงข้างและพร้อมจะจับมือเดินไปด้วยกันในทุกสถานการณ์ เป็นสิ่งล้ำค่าที่เราจะจดจำตลอดไป",
     "ทุกเสียงหัวเราะ ทุกน้ำตา และทุกช่วงเวลาที่เราเคยใช้ร่วมกัน จะกลายเป็นความทรงจำที่มีค่าและอยู่ในใจของเราเสมอ เราขอบคุณเพื่อนทุกคนที่ไม่เคยทอดทิ้งกัน คอยอยู่เคียงข้างในวันที่อ่อนแอ และร่วมยินดีในวันที่เราประสบความสำเร็จ ",
     "ในอนาคตข้างหน้า ไม่ว่าแต่ละคนจะเลือกเดินบนเส้นทางแบบไหน ขอให้เพื่อน ๆ ทุกคนประสบความสำเร็จในสิ่งที่ตั้งใจไว้ และมีความสุขในทุก ๆ ก้าวที่เดินต่อไป แม้ว่าเราจะต้องแยกย้ายกัน แต่ความทรงจำและความผูกพันของเราจะยังคงอยู่เสมอ หวังว่าเราจะมีโอกาสได้พบเจอและแบ่งปันเรื่องราวใหม่ ๆ ให้กันและกันในวันข้างหน้า",
     "สุดท้ายนี้ เราขอขอบคุณจากใจจริงสำหรับทุกความห่วงใยและความรักที่เพื่อน ๆ มอบให้ ทุกสิ่งที่เราได้รับในวันนี้จะเป็นแรงผลักดันให้เราก้าวไปข้างหน้าอย่างมั่นใจ ขอให้มิตรภาพของเราคงอยู่ตลอดไป และขอให้เพื่อน ๆ ทุกคนรู้ไว้ว่า ไม่ว่าจะนานแค่ไหน เราจะยังคิดถึงกันเสมอ"];
//console.log(getRandomValue(colors)); 

function SecondPage() {
  const location = useLocation();  // ใช้ useLocation เพื่อดึงข้อมูล state ที่ส่งมาจาก FirstPage
  const { name } = location.state || {};  // ถ้ามี state ให้ดึงชื่อมาใช้งาน
  //const { relationship } = location.state || {};  // ถ้ามี state ให้ดึงชื่อมาใช้งาน

  return (
    <div class='App-header'>
        <div class="bgblue">
        <div class="card">
            <h1 class="text">ถึง { name }!</h1>
            <p class="text-full"> { getRandomValue(colors) }!</p>
        </div>
        </div>
    </div>
  );
}

export default SecondPage;